Case1_Mesh3_Cell_20x150/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3000;
        startFace       5830;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3000;
        startFace       8830;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       11830;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       11850;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       11870;
    }
    pared
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       11870;
    }
)

// ************************************************************************* //
