Case1_Mesh3_Cell_20x150/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    thermalPhaseChangeTwoPhaseSystem;

phases (steam water);

phaseChange on;

steam
{
	type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d                0.0003; 
    }
    Sc              0.7;

    residualAlpha   1e-4;
}

water
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               0.0006; 
    }
    Sc              0.7;

    residualAlpha   1e-4;
}

blending
{
	
   default
    {
        type            linear;
        minFullyContinuousAlpha.steam 0.7;
        minPartlyContinuousAlpha.steam 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }
    

    heatTransfer.steam
    {
        type            none;
	continuousPhase water;
       
    }

    heatTransfer.water
    {
        type            none;
	continuousPhase water;
       
    }

}



surfaceTension
(
    (steam and water)
    {
        type            constant;
        sigma           0.038; 
    }

    (water and steam)
    {
        type            constant;
        sigma           0.038; 
    }
);

saturationModel
{
        type constant;

        Tsat 530.65;
        pSat 4.5e6;
};

aspectRatio
(
//Esto lo tenia implementado yo en el trabajo

    (steam in water)
    {
        type            constant;
        E0              0.01777207997368;
    }

    (water in steam)
    {
        type            constant;
        E0               0.07108831989474; 
    }
);

drag
(
 	(steam in water)
    {
        type            Grace; 
		A		16;
        residualAlpha   1e-6;
        residualRe      1e-6;
		muref1          0.0009;
		gref		9.81;		        
		swarmCorrection
        {
            type        none;
        }
    }

    (water in steam)
    {
      	type            TomiyamaCorrelated; 
		A		16;        
		residualRe      1e-3;
		residualAlpha   1e-3;        
        swarmCorrection
        {
            type        none;
        }
    }

    (steam and water)
    {
        type            segregated;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }


);

virtualMass
(
    
    (steam in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (water in steam)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer.steam
(
    (steam in water)
    {
		type            RanzMarshall;		
        residualAlpha   1e-3;        
    }

	(water in steam)
    {
		type            RanzMarshall; 
        residualAlpha   1e-3;        
    }

);

heatTransfer.water
(
    (steam in water)
    {
		type            RanzMarshall; 		
        residualAlpha   1e-3;        
    }

	(water in steam)
    {
		type            RanzMarshall;
        residualAlpha   1e-3;        
    }

);


phaseTransfer
();

lift
(
	(steam in water)
    {
     	type            Tomiyama; 
    }

  	(water in steam)
    {
     	type            Tomiyama; 
    }
);

wallLubrication
(
	(steam in water)
    {
     	type            Frank; 
        Cwd             6.8;
   		Cwc		10; 
    	p		1.7;		
    
    }
	(water in steam)
    {
     	type            Frank;
        Cwd             6.8; 
   		Cwc		10;
    	p		1.7;
    }
);

turbulentDispersion
(
     (steam in water)
     {
        type                Burns; 
        sigma               0.7; 
        Ctd                 1; 
        residualAlpha       1e-4 ; 
    }

	(water in steam)
    {
     	type                Burns; 
        sigma               0.9;
        Ctd                 0.5;
        residualAlpha       1e-4;
    
    }

);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
