Case1_Mesh3_Cell_20x150/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 4.5e6;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 4.5e6;
    }
    outlet
    {
        type            calculated;
        value           uniform 4.5e6;
    }

	back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }

    pared
    {
        type            calculated;
        value           uniform 4.5e6;
    }
}


// ************************************************************************* //
