Case1_Mesh3_Cell_20x150/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
        maxIter         100;
        minIter         2;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "(e|h).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0.001;
        minIter         1;
        maxIter         20;
    }

    "(k|epsilon|Theta|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    Yi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 3;
    nEnergyCorrectors   13;
    faceMomentum        yes;
}


relaxationFactors
{
       fields
    {
		iDmdt           0.1;
        "p_rgh"         0.4;
		"p"             0.4;
		"pFinal"		0.4;
		"p_rghFinal"	0.4;
    }
    equations
    {

        "U.*"           0.6;
        "U.gasFinal"    0.6;
        "U.liquidFinal"  0.6;
     	"k.gas"    		0.3;
     	"k.liquid"  		0.3;
     	"k.gasFinal"    		0.3;
     	"k.liquidFinal"  		0.3;
        "epsilon.gas"    		0.3;
     	"epsilon.liquid"  		0.3;
     	"epsilon.gasFinal"    	0.3;
     	"epsilon.liquidFinal"  	0.3;
		"omega.gas"             0.3;
		"omega.gasFinal"             0.3;
		"omega.liquid"      0.3;
		"omega.liquidFinal"      0.3;
        "e.gas*"              0.3;
        "e.liquid*"                0.3; 
		"h.*"           0.3;

    }

    }
}


// ************************************************************************* //
