Case1_Mesh3_Cell_20x150/system/postproceso/averageFields
// Obtengo los campos promedios

	fieldAverage1
    {
        type            fieldAverage;
        libs ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
        fields
        (
            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.steam
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.steam
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            T.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			wDmdt.steamAndWater
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			iDmdt.steamAndWater
			{
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

			alphat.water
			{
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }


        );
    }
